mod diagram
